// null(при typeof возвращается null), undefined, boolean, number, string, object(только он не примитивный), symbol(с ES6)
// typeof function() {} -> function(не object)
// undefined возвращается при объявлении переменных и в функциях без return, null говорит об отсутствии значения

// types
// К false привод', 0, null, undefined, NaN, false
// + со сторками приводит результат к строке, но при умножении сторк получается число(так как эта опреация не определена для строк, также для других опрераций)
// также нужно смотреть на порядок операций


